jvarghes2501/Embedded_System_Course/STM32F407G-DISC1_driver/Src/2_LED_button.c
/*
 * 2_LED_button.c
 *
 *  Created on: Apr 22, 2025
 *      Author: jesti
 */


# include "stm32f407xx.h"
# include "stm32f407xx_gpio_driver.h"

void delay (void){
	for (uint32_t i = 0; i < 500000/2; i++);
}
int main(void){

	GPIO_Handle_t GpioLed, GpioButton;
	//led
	GpioLed.pGPIOx = GPIOD;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinOPType = GPIO_OUT_TYPE_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinPull_up_down_control = GPIO_NO_PUPD;

	GPIO_ClockControl(GPIOD, ENABLE);
	GPIO_Init(&GpioLed);

	//button
	GpioLed.pGPIOx = GPIOA;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IN;
	GpioLed.GPIO_PinConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GpioLed.GPIO_PinConfig.GPIO_PinPull_up_down_control = GPIO_NO_PUPD;

	GPIO_ClockControl(GPIOA, ENABLE);
	GPIO_Init(&GpioButton);

	while (1){
		if(GPIO_ReadInputPin(GPIOA, GPIO_PIN_NO_0)==1){
			delay(); // used to make sure the button is out of debouncing state before setting output
			GPIO_ToggleOutputPin(GPIOD, GPIO_PIN_NO_12);
		}
	}
	return 0;
}
